
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 15 to add, 11 to change, 10 to destroy.</code></pre>

* Create
  * module.load_balancers[&#34;legacy&#34;].azurerm_lb.this
  * module.load_balancers[&#34;legacy&#34;].azurerm_lb_backend_address_pool.this
  * module.load_balancers[&#34;legacy&#34;].azurerm_lb_backend_address_pool_address.this[&#34;ccd-data-0&#34;]
  * module.load_balancers[&#34;legacy&#34;].azurerm_lb_backend_address_pool_address.this[&#34;ccd-data-1&#34;]
  * module.load_balancers[&#34;legacy&#34;].azurerm_lb_backend_address_pool_address.this[&#34;ccd-data-2&#34;]
  * module.load_balancers[&#34;legacy&#34;].azurerm_lb_backend_address_pool_address.this[&#34;ccd-data-3&#34;]
  * module.load_balancers[&#34;legacy&#34;].azurerm_lb_probe.this[&#34;http&#34;]
  * module.load_balancers[&#34;legacy&#34;].azurerm_lb_probe.this[&#34;transport&#34;]
  * module.load_balancers[&#34;legacy&#34;].azurerm_lb_rule.this[&#34;http&#34;]
  * module.load_balancers[&#34;legacy&#34;].azurerm_lb_rule.this[&#34;transport&#34;]
  * module.storageaccount.azapi_update_resource.defender_settings
  * module.storageaccount.azurerm_storage_account.storage_account
  * module.storageaccount.azurerm_storage_container.container[&#34;es-snapshots&#34;]
  * module.storageaccount.random_string.storage_account_random_string
  * module.storageaccount.time_static.pim_start
* Update
  * azurerm_network_security_rule.nsg_rules[&#34;AKS_To_ES&#34;]
  * azurerm_network_security_rule.nsg_rules[&#34;App_To_ES&#34;]
  * azurerm_network_security_rule.nsg_rules[&#34;Bastion_To_ES&#34;]
  * azurerm_network_security_rule.nsg_rules[&#34;ElasticClusterTransport&#34;]
  * azurerm_network_security_rule.nsg_rules[&#34;Jenkins_To_ES&#34;]
  * azurerm_network_security_rule.nsg_rules[&#34;LB_To_ES&#34;]
  * azurerm_network_security_rule.nsg_rules[&#34;SSH&#34;]
  * module.elastic2[&#34;ccd-data-0&#34;].module.virtual-machines.azurerm_virtual_machine_extension.entra[0]
  * module.elastic2[&#34;ccd-data-1&#34;].module.virtual-machines.azurerm_virtual_machine_extension.entra[0]
  * module.elastic2[&#34;ccd-data-2&#34;].module.virtual-machines.azurerm_virtual_machine_extension.entra[0]
  * module.elastic2[&#34;ccd-data-3&#34;].module.virtual-machines.azurerm_virtual_machine_extension.entra[0]
* Delete
  * module.main_lb.azurerm_lb.this
  * module.main_lb.azurerm_lb_backend_address_pool.this
  * module.main_lb.azurerm_lb_backend_address_pool_address.this[&#34;ccd-data-0&#34;]
  * module.main_lb.azurerm_lb_backend_address_pool_address.this[&#34;ccd-data-1&#34;]
  * module.main_lb.azurerm_lb_backend_address_pool_address.this[&#34;ccd-data-2&#34;]
  * module.main_lb.azurerm_lb_backend_address_pool_address.this[&#34;ccd-data-3&#34;]
  * module.main_lb.azurerm_lb_probe.this[&#34;http&#34;]
  * module.main_lb.azurerm_lb_probe.this[&#34;transport&#34;]
  * module.main_lb.azurerm_lb_rule.this[&#34;http&#34;]
  * module.main_lb.azurerm_lb_rule.this[&#34;transport&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_network_security_rule.nsg_rules["AKS_To_ES"] will be updated in-place
  ~ resource "azurerm_network_security_rule" "nsg_rules" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/CCD-ELASTIC-SEARCH-AAT/providers/Microsoft.Network/applicationSecurityGroups/CCD-DATA-ASG",
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ]
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/AKS_To_ES"
        name                                       = "AKS_To_ES"
        # (16 unchanged attributes hidden)
    }

  # azurerm_network_security_rule.nsg_rules["App_To_ES"] will be updated in-place
  ~ resource "azurerm_network_security_rule" "nsg_rules" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/CCD-ELASTIC-SEARCH-AAT/providers/Microsoft.Network/applicationSecurityGroups/CCD-DATA-ASG",
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ]
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/App_To_ES"
        name                                       = "App_To_ES"
        # (16 unchanged attributes hidden)
    }

  # azurerm_network_security_rule.nsg_rules["Bastion_To_ES"] will be updated in-place
  ~ resource "azurerm_network_security_rule" "nsg_rules" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/CCD-ELASTIC-SEARCH-AAT/providers/Microsoft.Network/applicationSecurityGroups/CCD-DATA-ASG",
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ]
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/Bastion_To_ES"
        name                                       = "Bastion_To_ES"
        # (16 unchanged attributes hidden)
    }

  # azurerm_network_security_rule.nsg_rules["ElasticClusterTransport"] will be updated in-place
  ~ resource "azurerm_network_security_rule" "nsg_rules" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/CCD-ELASTIC-SEARCH-AAT/providers/Microsoft.Network/applicationSecurityGroups/CCD-DATA-ASG",
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ]
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/ElasticClusterTransport"
        name                                       = "ElasticClusterTransport"
      ~ source_application_security_group_ids      = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/CCD-ELASTIC-SEARCH-AAT/providers/Microsoft.Network/applicationSecurityGroups/CCD-DATA-ASG",
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ]
        # (15 unchanged attributes hidden)
    }

  # azurerm_network_security_rule.nsg_rules["Jenkins_To_ES"] will be updated in-place
  ~ resource "azurerm_network_security_rule" "nsg_rules" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/CCD-ELASTIC-SEARCH-AAT/providers/Microsoft.Network/applicationSecurityGroups/CCD-DATA-ASG",
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ]
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/Jenkins_To_ES"
        name                                       = "Jenkins_To_ES"
        # (16 unchanged attributes hidden)
    }

  # azurerm_network_security_rule.nsg_rules["LB_To_ES"] will be updated in-place
  ~ resource "azurerm_network_security_rule" "nsg_rules" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/CCD-ELASTIC-SEARCH-AAT/providers/Microsoft.Network/applicationSecurityGroups/CCD-DATA-ASG",
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ]
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/LB_To_ES"
        name                                       = "LB_To_ES"
        # (16 unchanged attributes hidden)
    }

  # azurerm_network_security_rule.nsg_rules["SSH"] will be updated in-place
  ~ resource "azurerm_network_security_rule" "nsg_rules" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/CCD-ELASTIC-SEARCH-AAT/providers/Microsoft.Network/applicationSecurityGroups/CCD-DATA-ASG",
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ]
        id                                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/SSH"
        name                                       = "SSH"
        # (16 unchanged attributes hidden)
    }

  # module.load_balancers["legacy"].azurerm_lb.this will be created
  + resource "azurerm_lb" "this" {
      + id                   = (known after apply)
      + location             = "uksouth"
      + name                 = "ccd-internal-aat-lb"
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + public_ip_address_id = (known after apply)
      + resource_group_name  = "ccd-elastic-search-aat"
      + sku                  = "Standard"
      + sku_tier             = "Regional"
      + subnet_id            = (known after apply)
      + tags                 = {
          + "application"  = "core-case-data"
          + "autoShutdown" = "true"
          + "builtFrom"    = "https://github.com/HMCTS/ccd-elastic-search.git"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }

      + frontend_ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + id                                                 = (known after apply)
          + inbound_nat_rules                                  = (known after apply)
          + load_balancer_rules                                = (known after apply)
          + name                                               = "LBFE"
          + outbound_rules                                     = (known after apply)
          + private_ip_address                                 = "10.96.149.253"
          + private_ip_address_allocation                      = "Static"
          + private_ip_address_version                         = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          + subnet_id                                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/elasticsearch"
          + zones                                              = [
              + "1",
              + "2",
              + "3",
            ]
        }
    }

  # module.load_balancers["legacy"].azurerm_lb_backend_address_pool.this will be created
  + resource "azurerm_lb_backend_address_pool" "this" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + inbound_nat_rules         = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "LBBE"
      + outbound_rules            = (known after apply)
    }

  # module.load_balancers["legacy"].azurerm_lb_backend_address_pool_address.this["ccd-data-0"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "this" {
      + backend_address_pool_id       = (known after apply)
      + id                            = (known after apply)
      + inbound_nat_rule_port_mapping = (known after apply)
      + ip_address                    = "10.96.149.7"
      + name                          = "ccd-data-0"
      + virtual_network_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat"
    }

  # module.load_balancers["legacy"].azurerm_lb_backend_address_pool_address.this["ccd-data-1"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "this" {
      + backend_address_pool_id       = (known after apply)
      + id                            = (known after apply)
      + inbound_nat_rule_port_mapping = (known after apply)
      + ip_address                    = "10.96.149.5"
      + name                          = "ccd-data-1"
      + virtual_network_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat"
    }

  # module.load_balancers["legacy"].azurerm_lb_backend_address_pool_address.this["ccd-data-2"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "this" {
      + backend_address_pool_id       = (known after apply)
      + id                            = (known after apply)
      + inbound_nat_rule_port_mapping = (known after apply)
      + ip_address                    = "10.96.149.4"
      + name                          = "ccd-data-2"
      + virtual_network_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat"
    }

  # module.load_balancers["legacy"].azurerm_lb_backend_address_pool_address.this["ccd-data-3"] will be created
  + resource "azurerm_lb_backend_address_pool_address" "this" {
      + backend_address_pool_id       = (known after apply)
      + id                            = (known after apply)
      + inbound_nat_rule_port_mapping = (known after apply)
      + ip_address                    = "10.96.149.10"
      + name                          = "ccd-data-3"
      + virtual_network_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat"
    }

  # module.load_balancers["legacy"].azurerm_lb_probe.this["http"] will be created
  + resource "azurerm_lb_probe" "this" {
      + id                  = (known after apply)
      + interval_in_seconds = 5
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "es-probe-http-internal"
      + number_of_probes    = 2
      + port                = 9200
      + probe_threshold     = 1
      + protocol            = "Tcp"
    }

  # module.load_balancers["legacy"].azurerm_lb_probe.this["transport"] will be created
  + resource "azurerm_lb_probe" "this" {
      + id                  = (known after apply)
      + interval_in_seconds = 5
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "es-probe-transport-internal"
      + number_of_probes    = 2
      + port                = 9300
      + probe_threshold     = 1
      + protocol            = "Tcp"
    }

  # module.load_balancers["legacy"].azurerm_lb_rule.this["http"] will be created
  + resource "azurerm_lb_rule" "this" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 9200
      + disable_outbound_snat          = true
      + enable_floating_ip             = (known after apply)
      + enable_tcp_reset               = (known after apply)
      + floating_ip_enabled            = (known after apply)
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "LBFE"
      + frontend_port                  = 9200
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 4
      + load_distribution              = "Default"
      + loadbalancer_id                = (known after apply)
      + name                           = "es-http-internal"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
      + tcp_reset_enabled              = (known after apply)
    }

  # module.load_balancers["legacy"].azurerm_lb_rule.this["transport"] will be created
  + resource "azurerm_lb_rule" "this" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 9300
      + disable_outbound_snat          = true
      + enable_floating_ip             = (known after apply)
      + enable_tcp_reset               = (known after apply)
      + floating_ip_enabled            = (known after apply)
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "LBFE"
      + frontend_port                  = 9300
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 4
      + load_distribution              = "Default"
      + loadbalancer_id                = (known after apply)
      + name                           = "es-transport-internal"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
      + tcp_reset_enabled              = (known after apply)
    }

  # module.main_lb.azurerm_lb.this will be destroyed
  # (because azurerm_lb.this is not in configuration)
  - resource "azurerm_lb" "this" {
      - id                   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb" -> null
      - location             = "uksouth" -> null
      - name                 = "ccd-internal-aat-lb" -> null
      - private_ip_address   = "10.96.149.253" -> null
      - private_ip_addresses = [
          - "10.96.149.253",
        ] -> null
      - resource_group_name  = "ccd-elastic-search-aat" -> null
      - sku                  = "Standard" -> null
      - sku_tier             = "Regional" -> null
      - tags                 = {
          - "application"  = "core-case-data"
          - "autoShutdown" = "true"
          - "builtFrom"    = "https://github.com/HMCTS/ccd-elastic-search.git"
          - "businessArea" = "CFT"
          - "criticality"  = "High"
          - "environment"  = "staging"
          - "startupMode"  = "always"
        } -> null
        # (1 unchanged attribute hidden)

      - frontend_ip_configuration {
          - id                                                 = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb/frontendIPConfigurations/LBFE" -> null
          - inbound_nat_rules                                  = [] -> null
          - load_balancer_rules                                = [
              - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb/loadBalancingRules/es-http-internal",
              - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb/loadBalancingRules/es-transport-internal",
            ] -> null
          - name                                               = "LBFE" -> null
          - outbound_rules                                     = [] -> null
          - private_ip_address                                 = "10.96.149.253" -> null
          - private_ip_address_allocation                      = "Static" -> null
          - private_ip_address_version                         = "IPv4" -> null
          - subnet_id                                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/elasticsearch" -> null
          - zones                                              = [
              - "1",
              - "2",
              - "3",
            ] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # module.main_lb.azurerm_lb_backend_address_pool.this will be destroyed
  # (because azurerm_lb_backend_address_pool.this is not in configuration)
  - resource "azurerm_lb_backend_address_pool" "this" {
      - backend_ip_configurations = [] -> null
      - id                        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb/backendAddressPools/LBBE" -> null
      - inbound_nat_rules         = [] -> null
      - load_balancing_rules      = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb/loadBalancingRules/es-transport-internal",
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb/loadBalancingRules/es-http-internal",
        ] -> null
      - loadbalancer_id           = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb" -> null
      - name                      = "LBBE" -> null
      - outbound_rules            = [] -> null
        # (2 unchanged attributes hidden)
    }

  # module.main_lb.azurerm_lb_backend_address_pool_address.this["ccd-data-0"] will be destroyed
  # (because azurerm_lb_backend_address_pool_address.this is not in configuration)
  - resource "azurerm_lb_backend_address_pool_address" "this" {
      - backend_address_pool_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb/backendAddressPools/LBBE" -> null
      - id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb/backendAddressPools/LBBE/addresses/ccd-data-0" -> null
      - inbound_nat_rule_port_mapping       = [] -> null
      - ip_address                          = "10.96.149.7" -> null
      - name                                = "ccd-data-0" -> null
      - virtual_network_id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat" -> null
        # (1 unchanged attribute hidden)
    }

  # module.main_lb.azurerm_lb_backend_address_pool_address.this["ccd-data-1"] will be destroyed
  # (because azurerm_lb_backend_address_pool_address.this is not in configuration)
  - resource "azurerm_lb_backend_address_pool_address" "this" {
      - backend_address_pool_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb/backendAddressPools/LBBE" -> null
      - id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb/backendAddressPools/LBBE/addresses/ccd-data-1" -> null
      - inbound_nat_rule_port_mapping       = [] -> null
      - ip_address                          = "10.96.149.5" -> null
      - name                                = "ccd-data-1" -> null
      - virtual_network_id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat" -> null
        # (1 unchanged attribute hidden)
    }

  # module.main_lb.azurerm_lb_backend_address_pool_address.this["ccd-data-2"] will be destroyed
  # (because azurerm_lb_backend_address_pool_address.this is not in configuration)
  - resource "azurerm_lb_backend_address_pool_address" "this" {
      - backend_address_pool_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb/backendAddressPools/LBBE" -> null
      - id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb/backendAddressPools/LBBE/addresses/ccd-data-2" -> null
      - inbound_nat_rule_port_mapping       = [] -> null
      - ip_address                          = "10.96.149.4" -> null
      - name                                = "ccd-data-2" -> null
      - virtual_network_id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat" -> null
        # (1 unchanged attribute hidden)
    }

  # module.main_lb.azurerm_lb_backend_address_pool_address.this["ccd-data-3"] will be destroyed
  # (because azurerm_lb_backend_address_pool_address.this is not in configuration)
  - resource "azurerm_lb_backend_address_pool_address" "this" {
      - backend_address_pool_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb/backendAddressPools/LBBE" -> null
      - id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb/backendAddressPools/LBBE/addresses/ccd-data-3" -> null
      - inbound_nat_rule_port_mapping       = [] -> null
      - ip_address                          = "10.96.149.10" -> null
      - name                                = "ccd-data-3" -> null
      - virtual_network_id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat" -> null
        # (1 unchanged attribute hidden)
    }

  # module.main_lb.azurerm_lb_probe.this["http"] will be destroyed
  # (because azurerm_lb_probe.this is not in configuration)
  - resource "azurerm_lb_probe" "this" {
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb/probes/es-probe-http-internal" -> null
      - interval_in_seconds = 5 -> null
      - load_balancer_rules = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb/loadBalancingRules/es-http-internal",
        ] -> null
      - loadbalancer_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb" -> null
      - name                = "es-probe-http-internal" -> null
      - number_of_probes    = 2 -> null
      - port                = 9200 -> null
      - probe_threshold     = 1 -> null
      - protocol            = "Tcp" -> null
        # (1 unchanged attribute hidden)
    }

  # module.main_lb.azurerm_lb_probe.this["transport"] will be destroyed
  # (because azurerm_lb_probe.this is not in configuration)
  - resource "azurerm_lb_probe" "this" {
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb/probes/es-probe-transport-internal" -> null
      - interval_in_seconds = 5 -> null
      - load_balancer_rules = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb/loadBalancingRules/es-transport-internal",
        ] -> null
      - loadbalancer_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb" -> null
      - name                = "es-probe-transport-internal" -> null
      - number_of_probes    = 2 -> null
      - port                = 9300 -> null
      - probe_threshold     = 1 -> null
      - protocol            = "Tcp" -> null
        # (1 unchanged attribute hidden)
    }

  # module.main_lb.azurerm_lb_rule.this["http"] will be destroyed
  # (because azurerm_lb_rule.this is not in configuration)
  - resource "azurerm_lb_rule" "this" {
      - backend_address_pool_ids       = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb/backendAddressPools/LBBE",
        ] -> null
      - backend_port                   = 9200 -> null
      - disable_outbound_snat          = true -> null
      - enable_floating_ip             = false -> null
      - enable_tcp_reset               = false -> null
      - floating_ip_enabled            = false -> null
      - frontend_ip_configuration_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb/frontendIPConfigurations/LBFE" -> null
      - frontend_ip_configuration_name = "LBFE" -> null
      - frontend_port                  = 9200 -> null
      - id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb/loadBalancingRules/es-http-internal" -> null
      - idle_timeout_in_minutes        = 4 -> null
      - load_distribution              = "Default" -> null
      - loadbalancer_id                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb" -> null
      - name                           = "es-http-internal" -> null
      - probe_id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb/probes/es-probe-http-internal" -> null
      - protocol                       = "Tcp" -> null
      - tcp_reset_enabled              = false -> null
    }

  # module.main_lb.azurerm_lb_rule.this["transport"] will be destroyed
  # (because azurerm_lb_rule.this is not in configuration)
  - resource "azurerm_lb_rule" "this" {
      - backend_address_pool_ids       = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb/backendAddressPools/LBBE",
        ] -> null
      - backend_port                   = 9300 -> null
      - disable_outbound_snat          = true -> null
      - enable_floating_ip             = false -> null
      - enable_tcp_reset               = false -> null
      - floating_ip_enabled            = false -> null
      - frontend_ip_configuration_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb/frontendIPConfigurations/LBFE" -> null
      - frontend_ip_configuration_name = "LBFE" -> null
      - frontend_port                  = 9300 -> null
      - id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb/loadBalancingRules/es-transport-internal" -> null
      - idle_timeout_in_minutes        = 4 -> null
      - load_distribution              = "Default" -> null
      - loadbalancer_id                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb" -> null
      - name                           = "es-transport-internal" -> null
      - probe_id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Network/loadBalancers/ccd-internal-aat-lb/probes/es-probe-transport-internal" -> null
      - protocol                       = "Tcp" -> null
      - tcp_reset_enabled              = false -> null
    }

  # module.storageaccount.azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = {
          + properties = {
              + isEnabled                         = false
              + malwareScanning                   = {
                  + onUpload = {
                      + capGBPerMonth = -1
                      + isEnabled     = false
                    }
                }
              + overrideSubscriptionLevelSettings = true
              + sensitiveDataDiscovery            = {
                  + isEnabled = false
                }
            }
        }
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + sensitive_body          = (write-only attribute)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.storageaccount.azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "uksouth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "ccdelasticsnapshotaat"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "ccd-elastic-search-aat"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "application"         = "core-case-data"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/ccd-elastic-search.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ccd-community"
          + "environment"         = "staging"
          + "managedBy"           = "CCD"
        }

      + blob_properties (known after apply)

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Deny"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.storageaccount.azurerm_storage_container.container["es-snapshots"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "es-snapshots"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "ccdelasticsnapshotaat"
    }

  # module.storageaccount.random_string.storage_account_random_string will be created
  + resource "random_string" "storage_account_random_string" {
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.storageaccount.time_static.pim_start will be created
  + resource "time_static" "pim_start" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.elastic2["ccd-data-0"].module.virtual-machines.azurerm_virtual_machine_extension.entra[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "entra" {
        id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Compute/virtualMachines/ccd-data-0/extensions/AADSSHLoginForLinux"
        name                        = "AADSSHLoginForLinux"
      ~ tags                        = {
          - "application"  = "core-case-data" -> null
          - "builtFrom"    = "https://github.com/HMCTS/ccd-elastic-search.git" -> null
          - "businessArea" = "CFT" -> null
          - "environment"  = "staging" -> null
        }
        # (8 unchanged attributes hidden)
    }

  # module.elastic2["ccd-data-1"].module.virtual-machines.azurerm_virtual_machine_extension.entra[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "entra" {
        id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Compute/virtualMachines/ccd-data-1/extensions/AADSSHLoginForLinux"
        name                        = "AADSSHLoginForLinux"
      ~ tags                        = {
          - "application"  = "core-case-data" -> null
          - "builtFrom"    = "https://github.com/HMCTS/ccd-elastic-search.git" -> null
          - "businessArea" = "CFT" -> null
          - "environment"  = "staging" -> null
        }
        # (8 unchanged attributes hidden)
    }

  # module.elastic2["ccd-data-2"].module.virtual-machines.azurerm_virtual_machine_extension.entra[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "entra" {
        id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Compute/virtualMachines/ccd-data-2/extensions/AADSSHLoginForLinux"
        name                        = "AADSSHLoginForLinux"
      ~ tags                        = {
          - "application"  = "core-case-data" -> null
          - "builtFrom"    = "https://github.com/HMCTS/ccd-elastic-search.git" -> null
          - "businessArea" = "CFT" -> null
          - "environment"  = "staging" -> null
        }
        # (8 unchanged attributes hidden)
    }

  # module.elastic2["ccd-data-3"].module.virtual-machines.azurerm_virtual_machine_extension.entra[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "entra" {
        id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-elastic-search-aat/providers/Microsoft.Compute/virtualMachines/ccd-data-3/extensions/AADSSHLoginForLinux"
        name                        = "AADSSHLoginForLinux"
      ~ tags                        = {
          - "application"  = "core-case-data" -> null
          - "builtFrom"    = "https://github.com/HMCTS/ccd-elastic-search.git" -> null
          - "businessArea" = "CFT" -> null
          - "environment"  = "staging" -> null
        }
        # (8 unchanged attributes hidden)
    }

Plan: 15 to add, 11 to change, 10 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":259,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->